Revit 2027 API
ModelCurveArray.Append Method
Add the model curve to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	ModelCurve item
)
Public Overridable Sub Append (
	item As ModelCurve
)
public:
virtual void Append(
	ModelCurve^ item
)
abstract Append :
        item : ModelCurve -> unit
override Append :
        item : ModelCurve -> unit
Parameters
item ModelCurve
The model curve to be added.
See Also
Reference
ModelCurveArray Class
Autodesk.Revit.DB Namespace